GopalSaraf/Practicals/PSDL/include/proc/pic18f26k40.h
extern volatile RXPPSbits_t RXPPSbits __at(0xEB5);
// bitfield macros
#define _RXPPS_PIN_POSN                                     0x0
#define _RXPPS_PIN_POSITION                                 0x0
#define _RXPPS_PIN_SIZE                                     0x3
#define _RXPPS_PIN_LENGTH                                   0x3
#define _RXPPS_PIN_MASK                                     0x7
#define _RXPPS_PORT_POSN                                    0x3
#define _RXPPS_PORT_POSITION                                0x3
#define _RXPPS_PORT_SIZE                                    0x2
#define _RXPPS_PORT_LENGTH                                  0x2
#define _RXPPS_PORT_MASK                                    0x18
#define _RXPPS_RXPPS_POSN                                   0x0
#define _RXPPS_RXPPS_POSITION                               0x0
#define _RXPPS_RXPPS_SIZE                                   0x5
#define _RXPPS_RXPPS_LENGTH                                 0x5
#define _RXPPS_RXPPS_MASK                                   0x1F
#define _RXPPS_RX1PPS_POSN                                  0x0
#define _RXPPS_RX1PPS_POSITION                              0x0
#define _RXPPS_RX1PPS_SIZE                                  0x5
#define _RXPPS_RX1PPS_LENGTH                                0x5
#define _RXPPS_RX1PPS_MASK                                  0x1F
#define _RXPPS_RX1PPS0_POSN                                 0x0
#define _RXPPS_RX1PPS0_POSITION                             0x0
#define _RXPPS_RX1PPS0_SIZE                                 0x1
#define _RXPPS_RX1PPS0_LENGTH                               0x1
#define _RXPPS_RX1PPS0_MASK                                 0x1
#define _RXPPS_RX1PPS1_POSN                                 0x1
#define _RXPPS_RX1PPS1_POSITION                             0x1
#define _RXPPS_RX1PPS1_SIZE                                 0x1
#define _RXPPS_RX1PPS1_LENGTH                               0x1
#define _RXPPS_RX1PPS1_MASK                                 0x2
#define _RXPPS_RX1PPS2_POSN                                 0x2
#define _RXPPS_RX1PPS2_POSITION                             0x2
#define _RXPPS_RX1PPS2_SIZE                                 0x1
#define _RXPPS_RX1PPS2_LENGTH                               0x1
#define _RXPPS_RX1PPS2_MASK                                 0x4
#define _RXPPS_RX1PPS3_POSN                                 0x3
#define _RXPPS_RX1PPS3_POSITION                             0x3
#define _RXPPS_RX1PPS3_SIZE                                 0x1
#define _RXPPS_RX1PPS3_LENGTH                               0x1
#define _RXPPS_RX1PPS3_MASK                                 0x8
#define _RXPPS_RX1PPS4_POSN                                 0x4
#define _RXPPS_RX1PPS4_POSITION                             0x4
#define _RXPPS_RX1PPS4_SIZE                                 0x1
#define _RXPPS_RX1PPS4_LENGTH                               0x1
#define _RXPPS_RX1PPS4_MASK                                 0x10

// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0xEB6);
#ifndef _LIB_BUILD
asm("CK1PPS equ 0EB6h");
#endif
// aliases
extern volatile unsigned char           TX1PPS              __at(0xEB6);
#ifndef _LIB_BUILD
asm("TX1PPS equ 0EB6h");
#endif
extern volatile unsigned char           CKPPS               __at(0xEB6);
#ifndef _LIB_BUILD
asm("CKPPS equ 0EB6h");
#endif
extern volatile unsigned char           TXPPS               __at(0xEB6);
#ifndef _LIB_BUILD
asm("TXPPS equ 0EB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS                  :5;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
    struct {
        unsigned TX1PPS                 :5;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0xEB6);
// bitfield macros
#define _CK1PPS_PIN_POSN                                    0x0
#define _CK1PPS_PIN_POSITION                                0x0
#define _CK1PPS_PIN_SIZE                                    0x3
#define _CK1PPS_PIN_LENGTH                                  0x3
#define _CK1PPS_PIN_MASK                                    0x7
#define _CK1PPS_PORT_POSN                                   0x3
#define _CK1PPS_PORT_POSITION                               0x3
#define _CK1PPS_PORT_SIZE                                   0x2
#define _CK1PPS_PORT_LENGTH                                 0x2
#define _CK1PPS_PORT_MASK                                   0x18
#define _CK1PPS_TXPPS_POSN                                  0x0
#define _CK1PPS_TXPPS_POSITION                              0x0
#define _CK1PPS_TXPPS_SIZE                                  0x5
#define _CK1PPS_TXPPS_LENGTH                                0x5
#define _CK1PPS_TXPPS_MASK                                  0x1F
#define _CK1PPS_TX1PPS0_POSN                                0x0
#define _CK1PPS_TX1PPS0_POSITION                            0x0
#define _CK1PPS_TX1PPS0_SIZE                                0x1
#define _CK1PPS_TX1PPS0_LENGTH                              0x1
#define _CK1PPS_TX1PPS0_MASK                                0x1
#define _CK1PPS_TX1PPS1_POSN                                0x1
#define _CK1PPS_TX1PPS1_POSITION                            0x1
#define _CK1PPS_TX1PPS1_SIZE                                0x1
#define _CK1PPS_TX1PPS1_LENGTH                              0x1
#define _CK1PPS_TX1PPS1_MASK                                0x2
#define _CK1PPS_TX1PPS2_POSN                                0x2
#define _CK1PPS_TX1PPS2_POSITION                            0x2
#define _CK1PPS_TX1PPS2_SIZE                                0x1
#define _CK1PPS_TX1PPS2_LENGTH                              0x1
#define _CK1PPS_TX1PPS2_MASK                                0x4
#define _CK1PPS_TX1PPS3_POSN                                0x3
#define _CK1PPS_TX1PPS3_POSITION                            0x3
#define _CK1PPS_TX1PPS3_SIZE                                0x1
#define _CK1PPS_TX1PPS3_LENGTH                              0x1
#define _CK1PPS_TX1PPS3_MASK                                0x8
#define _CK1PPS_TX1PPS4_POSN                                0x4
#define _CK1PPS_TX1PPS4_POSITION                            0x4
#define _CK1PPS_TX1PPS4_SIZE                                0x1
#define _CK1PPS_TX1PPS4_LENGTH                              0x1
#define _CK1PPS_TX1PPS4_MASK                                0x10
#define _CK1PPS_TX1PPS_POSN                                 0x0
#define _CK1PPS_TX1PPS_POSITION                             0x0
#define _CK1PPS_TX1PPS_SIZE                                 0x5
#define _CK1PPS_TX1PPS_LENGTH                               0x5
#define _CK1PPS_TX1PPS_MASK                                 0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS                  :5;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
    struct {
        unsigned TX1PPS                 :5;
    };
} TX1PPSbits_t;
extern volatile TX1PPSbits_t TX1PPSbits __at(0xEB6);
// bitfield macros
#define _TX1PPS_PIN_POSN                                    0x0
#define _TX1PPS_PIN_POSITION                                0x0
#define _TX1PPS_PIN_SIZE                                    0x3
#define _TX1PPS_PIN_LENGTH                                  0x3
#define _TX1PPS_PIN_MASK                                    0x7
#define _TX1PPS_PORT_POSN                                   0x3
#define _TX1PPS_PORT_POSITION                               0x3
#define _TX1PPS_PORT_SIZE                                   0x2
#define _TX1PPS_PORT_LENGTH                                 0x2
#define _TX1PPS_PORT_MASK                                   0x18
#define _TX1PPS_TXPPS_POSN                                  0x0
#define _TX1PPS_TXPPS_POSITION                              0x0
#define _TX1PPS_TXPPS_SIZE                                  0x5
#define _TX1PPS_TXPPS_LENGTH                                0x5
#define _TX1PPS_TXPPS_MASK                                  0x1F
#define _TX1PPS_TX1PPS0_POSN                                0x0
#define _TX1PPS_TX1PPS0_POSITION                            0x0
#define _TX1PPS_TX1PPS0_SIZE                                0x1
#define _TX1PPS_TX1PPS0_LENGTH                              0x1
#define _TX1PPS_TX1PPS0_MASK                                0x1
#define _TX1PPS_TX1PPS1_POSN                                0x1
#define _TX1PPS_TX1PPS1_POSITION                            0x1
#define _TX1PPS_TX1PPS1_SIZE                                0x1
#define _TX1PPS_TX1PPS1_LENGTH                              0x1
#define _TX1PPS_TX1PPS1_MASK                                0x2
#define _TX1PPS_TX1PPS2_POSN                                0x2
#define _TX1PPS_TX1PPS2_POSITION                            0x2
#define _TX1PPS_TX1PPS2_SIZE                                0x1
#define _TX1PPS_TX1PPS2_LENGTH                              0x1
#define _TX1PPS_TX1PPS2_MASK                                0x4
#define _TX1PPS_TX1PPS3_POSN                                0x3
#define _TX1PPS_TX1PPS3_POSITION                            0x3
#define _TX1PPS_TX1PPS3_SIZE                                0x1
#define _TX1PPS_TX1PPS3_LENGTH                              0x1
#define _TX1PPS_TX1PPS3_MASK                                0x8
#define _TX1PPS_TX1PPS4_POSN                                0x4
#define _TX1PPS_TX1PPS4_POSITION                            0x4
#define _TX1PPS_TX1PPS4_SIZE                                0x1
#define _TX1PPS_TX1PPS4_LENGTH                              0x1
#define _TX1PPS_TX1PPS4_MASK                                0x10
#define _TX1PPS_TX1PPS_POSN                                 0x0
#define _TX1PPS_TX1PPS_POSITION                             0x0
#define _TX1PPS_TX1PPS_SIZE                                 0x5
#define _TX1PPS_TX1PPS_LENGTH                               0x5
#define _TX1PPS_TX1PPS_MASK                                 0x1F
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS                  :5;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
    struct {
        unsigned TX1PPS                 :5;
    };
} CKPPSbits_t;
extern volatile CKPPSbits_t CKPPSbits __at(0xEB6);
// bitfield macros
#define _CKPPS_PIN_POSN                                     0x0
#define _CKPPS_PIN_POSITION                                 0x0
#define _CKPPS_PIN_SIZE                                     0x3
#define _CKPPS_PIN_LENGTH                                   0x3
#define _CKPPS_PIN_MASK                                     0x7
#define _CKPPS_PORT_POSN                                    0x3
#define _CKPPS_PORT_POSITION                                0x3
#define _CKPPS_PORT_SIZE                                    0x2
#define _CKPPS_PORT_LENGTH                                  0x2
#define _CKPPS_PORT_MASK                                    0x18
#define _CKPPS_TXPPS_POSN                                   0x0
#define _CKPPS_TXPPS_POSITION                               0x0
#define _CKPPS_TXPPS_SIZE                                   0x5
#define _CKPPS_TXPPS_LENGTH                                 0x5
#define _CKPPS_TXPPS_MASK                                   0x1F
#define _CKPPS_TX1PPS0_POSN                                 0x0
#define _CKPPS_TX1PPS0_POSITION                             0x0
#define _CKPPS_TX1PPS0_SIZE                                 0x1
#define _CKPPS_TX1PPS0_LENGTH                               0x1
#define _CKPPS_TX1PPS0_MASK                                 0x1
#define _CKPPS_TX1PPS1_POSN                                 0x1
#define _CKPPS_TX1PPS1_POSITION                             0x1
#define _CKPPS_TX1PPS1_SIZE                                 0x1
#define _CKPPS_TX1PPS1_LENGTH                               0x1
#define _CKPPS_TX1PPS1_MASK                                 0x2
#define _CKPPS_TX1PPS2_POSN                                 0x2
#define _CKPPS_TX1PPS2_POSITION                             0x2
#define _CKPPS_TX1PPS2_SIZE                                 0x1
#define _CKPPS_TX1PPS2_LENGTH                               0x1
#define _CKPPS_TX1PPS2_MASK                                 0x4
#define _CKPPS_TX1PPS3_POSN                                 0x3
#define _CKPPS_TX1PPS3_POSITION                             0x3
#define _CKPPS_TX1PPS3_SIZE                                 0x1
#define _CKPPS_TX1PPS3_LENGTH                               0x1
#define _CKPPS_TX1PPS3_MASK                                 0x8
#define _CKPPS_TX1PPS4_POSN                                 0x4
#define _CKPPS_TX1PPS4_POSITION                             0x4
#define _CKPPS_TX1PPS4_SIZE                                 0x1
#define _CKPPS_TX1PPS4_LENGTH                               0x1
#define _CKPPS_TX1PPS4_MASK                                 0x10
#define _CKPPS_TX1PPS_POSN                                  0x0
#define _CKPPS_TX1PPS_POSITION                              0x0
#define _CKPPS_TX1PPS_SIZE                                  0x5
#define _CKPPS_TX1PPS_LENGTH                                0x5
#define _CKPPS_TX1PPS_MASK                                  0x1F
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS                  :5;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
    struct {
        unsigned TX1PPS                 :5;
    };
} TXPPSbits_t;
extern volatile TXPPSbits_t TXPPSbits __at(0xEB6);
// bitfield macros
#define _TXPPS_PIN_POSN                                     0x0
#define _TXPPS_PIN_POSITION                                 0x0
#define _TXPPS_PIN_SIZE                                     0x3
#define _TXPPS_PIN_LENGTH                                   0x3
#define _TXPPS_PIN_MASK                                     0x7
#define _TXPPS_PORT_POSN                                    0x3
#define _TXPPS_PORT_POSITION                                0x3
#define _TXPPS_PORT_SIZE                                    0x2
#define _TXPPS_PORT_LENGTH                                  0x2
#define _TXPPS_PORT_MASK                                    0x18
#define _TXPPS_TXPPS_POSN                                   0x0
#define _TXPPS_TXPPS_POSITION                               0x0
#define _TXPPS_TXPPS_SIZE                                   0x5
#define _TXPPS_TXPPS_LENGTH                                 0x5
#define _TXPPS_TXPPS_MASK                                   0x1F
#define _TXPPS_TX1PPS0_POSN                                 0x0
#define _TXPPS_TX1PPS0_POSITION                             0x0
#define _TXPPS_TX1PPS0_SIZE                                 0x1
#define _TXPPS_TX1PPS0_LENGTH                               0x1
#define _TXPPS_TX1PPS0_MASK                                 0x1
#define _TXPPS_TX1PPS1_POSN                                 0x1
#define _TXPPS_TX1PPS1_POSITION                             0x1
#define _TXPPS_TX1PPS1_SIZE                                 0x1
#define _TXPPS_TX1PPS1_LENGTH                               0x1
#define _TXPPS_TX1PPS1_MASK                                 0x2
#define _TXPPS_TX1PPS2_POSN                                 0x2
#define _TXPPS_TX1PPS2_POSITION                             0x2
#define _TXPPS_TX1PPS2_SIZE                                 0x1
#define _TXPPS_TX1PPS2_LENGTH                               0x1
#define _TXPPS_TX1PPS2_MASK                                 0x4
#define _TXPPS_TX1PPS3_POSN                                 0x3
#define _TXPPS_TX1PPS3_POSITION                             0x3
#define _TXPPS_TX1PPS3_SIZE                                 0x1
#define _TXPPS_TX1PPS3_LENGTH                               0x1
#define _TXPPS_TX1PPS3_MASK                                 0x8
#define _TXPPS_TX1PPS4_POSN                                 0x4
#define _TXPPS_TX1PPS4_POSITION                             0x4
#define _TXPPS_TX1PPS4_SIZE                                 0x1
#define _TXPPS_TX1PPS4_LENGTH                               0x1
#define _TXPPS_TX1PPS4_MASK                                 0x10
#define _TXPPS_TX1PPS_POSN                                  0x0
#define _TXPPS_TX1PPS_POSITION                              0x0
#define _TXPPS_TX1PPS_SIZE                                  0x5
#define _TXPPS_TX1PPS_LENGTH                                0x5
#define _TXPPS_TX1PPS_MASK                                  0x1F

