GopalSaraf/Practicals/PSDL/include/proc/pic18f26k40.h
// Register: SCANTRIG
#define SCANTRIG SCANTRIG
extern volatile unsigned char           SCANTRIG            __at(0xF50);
#ifndef _LIB_BUILD
asm("SCANTRIG equ 0F50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TSEL                   :4;
    };
    struct {
        unsigned TSEL0                  :1;
        unsigned TSEL1                  :1;
        unsigned TSEL2                  :1;
        unsigned TSEL3                  :1;
    };
    struct {
        unsigned SCANTSEL               :4;
    };
    struct {
        unsigned SCANTSEL0              :1;
        unsigned SCANTSEL1              :1;
        unsigned SCANTSEL2              :1;
        unsigned SCANTSEL3              :1;
    };
} SCANTRIGbits_t;
extern volatile SCANTRIGbits_t SCANTRIGbits __at(0xF50);
// bitfield macros
#define _SCANTRIG_TSEL_POSN                                 0x0
#define _SCANTRIG_TSEL_POSITION                             0x0
#define _SCANTRIG_TSEL_SIZE                                 0x4
#define _SCANTRIG_TSEL_LENGTH                               0x4
#define _SCANTRIG_TSEL_MASK                                 0xF
#define _SCANTRIG_TSEL0_POSN                                0x0
#define _SCANTRIG_TSEL0_POSITION                            0x0
#define _SCANTRIG_TSEL0_SIZE                                0x1
#define _SCANTRIG_TSEL0_LENGTH                              0x1
#define _SCANTRIG_TSEL0_MASK                                0x1
#define _SCANTRIG_TSEL1_POSN                                0x1
#define _SCANTRIG_TSEL1_POSITION                            0x1
#define _SCANTRIG_TSEL1_SIZE                                0x1
#define _SCANTRIG_TSEL1_LENGTH                              0x1
#define _SCANTRIG_TSEL1_MASK                                0x2
#define _SCANTRIG_TSEL2_POSN                                0x2
#define _SCANTRIG_TSEL2_POSITION                            0x2
#define _SCANTRIG_TSEL2_SIZE                                0x1
#define _SCANTRIG_TSEL2_LENGTH                              0x1
#define _SCANTRIG_TSEL2_MASK                                0x4
#define _SCANTRIG_TSEL3_POSN                                0x3
#define _SCANTRIG_TSEL3_POSITION                            0x3
#define _SCANTRIG_TSEL3_SIZE                                0x1
#define _SCANTRIG_TSEL3_LENGTH                              0x1
#define _SCANTRIG_TSEL3_MASK                                0x8
#define _SCANTRIG_SCANTSEL_POSN                             0x0
#define _SCANTRIG_SCANTSEL_POSITION                         0x0
#define _SCANTRIG_SCANTSEL_SIZE                             0x4
#define _SCANTRIG_SCANTSEL_LENGTH                           0x4
#define _SCANTRIG_SCANTSEL_MASK                             0xF
#define _SCANTRIG_SCANTSEL0_POSN                            0x0
#define _SCANTRIG_SCANTSEL0_POSITION                        0x0
#define _SCANTRIG_SCANTSEL0_SIZE                            0x1
#define _SCANTRIG_SCANTSEL0_LENGTH                          0x1
#define _SCANTRIG_SCANTSEL0_MASK                            0x1
#define _SCANTRIG_SCANTSEL1_POSN                            0x1
#define _SCANTRIG_SCANTSEL1_POSITION                        0x1
#define _SCANTRIG_SCANTSEL1_SIZE                            0x1
#define _SCANTRIG_SCANTSEL1_LENGTH                          0x1
#define _SCANTRIG_SCANTSEL1_MASK                            0x2
#define _SCANTRIG_SCANTSEL2_POSN                            0x2
#define _SCANTRIG_SCANTSEL2_POSITION                        0x2
#define _SCANTRIG_SCANTSEL2_SIZE                            0x1
#define _SCANTRIG_SCANTSEL2_LENGTH                          0x1
#define _SCANTRIG_SCANTSEL2_MASK                            0x4
#define _SCANTRIG_SCANTSEL3_POSN                            0x3
#define _SCANTRIG_SCANTSEL3_POSITION                        0x3
#define _SCANTRIG_SCANTSEL3_SIZE                            0x1
#define _SCANTRIG_SCANTSEL3_LENGTH                          0x1
#define _SCANTRIG_SCANTSEL3_MASK                            0x8

// Register: MDCON0
#define MDCON0 MDCON0
extern volatile unsigned char           MDCON0              __at(0xF51);
#ifndef _LIB_BUILD
asm("MDCON0 equ 0F51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIT                    :1;
        unsigned                        :3;
        unsigned OPOL                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MDBIT                  :1;
        unsigned                        :3;
        unsigned MDOPOL                 :1;
        unsigned MDOUT                  :1;
        unsigned                        :1;
        unsigned MDEN                   :1;
    };
} MDCON0bits_t;
extern volatile MDCON0bits_t MDCON0bits __at(0xF51);
// bitfield macros
#define _MDCON0_BIT_POSN                                    0x0
#define _MDCON0_BIT_POSITION                                0x0
#define _MDCON0_BIT_SIZE                                    0x1
#define _MDCON0_BIT_LENGTH                                  0x1
#define _MDCON0_BIT_MASK                                    0x1
#define _MDCON0_OPOL_POSN                                   0x4
#define _MDCON0_OPOL_POSITION                               0x4
#define _MDCON0_OPOL_SIZE                                   0x1
#define _MDCON0_OPOL_LENGTH                                 0x1
#define _MDCON0_OPOL_MASK                                   0x10
#define _MDCON0_OUT_POSN                                    0x5
#define _MDCON0_OUT_POSITION                                0x5
#define _MDCON0_OUT_SIZE                                    0x1
#define _MDCON0_OUT_LENGTH                                  0x1
#define _MDCON0_OUT_MASK                                    0x20
#define _MDCON0_EN_POSN                                     0x7
#define _MDCON0_EN_POSITION                                 0x7
#define _MDCON0_EN_SIZE                                     0x1
#define _MDCON0_EN_LENGTH                                   0x1
#define _MDCON0_EN_MASK                                     0x80
#define _MDCON0_MDBIT_POSN                                  0x0
#define _MDCON0_MDBIT_POSITION                              0x0
#define _MDCON0_MDBIT_SIZE                                  0x1
#define _MDCON0_MDBIT_LENGTH                                0x1
#define _MDCON0_MDBIT_MASK                                  0x1
#define _MDCON0_MDOPOL_POSN                                 0x4
#define _MDCON0_MDOPOL_POSITION                             0x4
#define _MDCON0_MDOPOL_SIZE                                 0x1
#define _MDCON0_MDOPOL_LENGTH                               0x1
#define _MDCON0_MDOPOL_MASK                                 0x10
#define _MDCON0_MDOUT_POSN                                  0x5
#define _MDCON0_MDOUT_POSITION                              0x5
#define _MDCON0_MDOUT_SIZE                                  0x1
#define _MDCON0_MDOUT_LENGTH                                0x1
#define _MDCON0_MDOUT_MASK                                  0x20
#define _MDCON0_MDEN_POSN                                   0x7
#define _MDCON0_MDEN_POSITION                               0x7
#define _MDCON0_MDEN_SIZE                                   0x1
#define _MDCON0_MDEN_LENGTH                                 0x1
#define _MDCON0_MDEN_MASK                                   0x80

